In [11]:
import pandas as pd
df=pd.read_csv('decision_tree_df.csv')
df

       company                  job     degree  salary>100k
0       google      sales executive  bachelors            0
1       google      sales executive    masters            0
2       google     business manager  bachelors            1
3       google     business manager    masters            1
4       google  computer programmer  bachelors            0
5       google  computer programmer    masters            1
6   abc pharma      sales executive    masters            0
7   abc pharma  computer programmer  bachelors            0
8   abc pharma     business manager  bachelors            0
9   abc pharma     business manager    masters            1
10    facebook      sales executive  bachelors            1
11    facebook      sales executive    masters            1
12    facebook     business manager  bachelors            1
13    facebook     business manager    masters            1
14    facebook  computer programmer  bachelors            1
15    facebook  computer programmer    masters            1

In [12]:
#dividing dataset into target variable and independent variable
#independent variable in inputs and taget in taget variable

inputs = df.drop('salary>100k',axis='columns')
target = df['salary>100k']

In [13]:
inputs.head(2)

  company              job     degree
0  google  sales executive  bachelors
1  google  sales executive    masters

In [17]:
#machine learning algorithms can only work on numbers they cannot understand labels
target.head()

0    0
1    0
2    1
3    1
4    0
Name: salary>100k, dtype: int64

In [18]:
#we have to convert labels into numbers so this is how it is done
from sklearn.preprocessing import LabelEncoder

In [19]:
#we have 3 different columns so we have to create 3 different objects
le_company = LabelEncoder() 
le_job = LabelEncoder()     
le_degree = LabelEncoder()

In [20]:
#creating extra columns for dataframe 
inputs['company_n'] = le_company.fit_transform(inputs['company'])
inputs['job_n'] = le_company.fit_transform(inputs['job'])
inputs['degree_n'] = le_company.fit_transform(inputs['degree'])

In [22]:
inputs.head(2)

  company              job     degree  company_n  job_n  degree_n
0  google  sales executive  bachelors          2      2         0
1  google  sales executive    masters          2      2         1

In [24]:
#Dropping label columns
inputs_n = inputs.drop(['company','job','degree'],axis='columns')
inputs_n

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [4]:
#fom sklearn.tree import DecisionTreeClassifier
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [34]:
#we can also use test and training method here
model.fit(inputs_n, target)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [29]:
model.score(inputs_n, target)

1.0

In [31]:
model.predict([[2,2,1]])
#it means person working in google , sales executive is his sales profile with master degree salary is not going to 
#more than 100 thousand dollar

array([0], dtype=int64)